source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/ItatingaSP.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<RecepcionarLoteRps versao="1.00">
			<Descricao>Recepcionar Lote RPS</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>https://itatinga-prefeitura.cecam.com.br/ISSWeb/WebServices/wsisseletronico.asmx?WSDL</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao>http://tempuri.org/EnviarLoteNotaFiscal</WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><EnviarLoteNotaFiscal xmlns="http://tempuri.org/"><xmlNotas>{xmlBodyScape}</xmlNotas><versao>002</versao></EnviarLoteNotaFiscal></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>EnviarLoteNotaFiscalResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap12</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://tempuri.org/</TargetNS>
		</RecepcionarLoteRps>
		<CancelarNfse versao="1.00">
			<Descricao>Cancelar nota fiscal de serviço</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>https://itatinga-prefeitura.cecam.com.br/ISSWeb/WebServices/wsisseletronico.asmx?WSDL</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao>http://tempuri.org/CancelarNotaFiscalEletronica</WebActionProducao>
			<SchemaArquivo>XSDISSECancelaNFe.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CancelarNotaFiscalEletronica xmlns="http://tempuri.org/"><xmlNotas>{xmlBodyScape}</xmlNotas><versao>004</versao></CancelarNotaFiscalEletronica></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>CancelarNotaFiscalEletronicaResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap12</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://tempuri.org/</TargetNS>
		</CancelarNfse>
		<ConsultarNfse versao="1.00">
			<Descricao>Consultar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>https://itatinga-prefeitura.cecam.com.br/ISSWeb/WebServices/wsisseletronico.asmx?WSDL</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao>http://tempuri.org/ConsultarNotaFiscal</WebActionProducao>
			<SchemaArquivo>XSDISSEConsultaNota.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNotaFiscal xmlns="http://tempuri.org/"><xmlNotas>{xmlBodyScape}</xmlNotas><versao>003</versao></ConsultarNotaFiscal></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ConsultarNotaFiscalResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap12</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://tempuri.org/</TargetNS>
		</ConsultarNfse>
	</Servicos>
</Configuracoes>